In [167]:
import numpy as np
import pandas as pd

### 1

In [168]:
nums = np.random.randint(1, 1000, size=50)
even = nums[nums%2==0]
odd = nums[nums%2!=0]

In [169]:
even_data=pd.DataFrame(even)
even_data.head(6)

     0
0  970
1  332
2  618
3  690
4  100
5  180

In [170]:
odd_data=pd.DataFrame(odd)
odd_data.tail(6)

      0
18  557
19  905
20  177
21  585
22  865
23  429

### 2

In [171]:
randoms = pd.Series(np.random.randint(1, 500, size=100))
(randoms[randoms % 2 == 0]).tail(5)

93    400
95     84
96     94
97    454
99    244
dtype: int32

### 4

In [172]:
names = ['Ali', 'Rom', 'Dip', 'Sim', 'Rik']
ages = np.random.randint(18, 22, size=5)
heights = np.random.randint(150, 180, size=5)
weights = np.random.randint(40, 90, size=5)
genders = ['Male', 'Female', 'Male', 'Female', 'Male']

data = {'Name': names,
        'Age': ages,
        'Height': heights,
        'Weight': weights,
        'Gender': genders}

students = pd.DataFrame(data,index=['A', 'B', 'C', 'D','E'])
students

  Name  Age  Height  Weight  Gender
A  Ali   19     164      58    Male
B  Rom   19     156      79  Female
C  Dip   18     169      54    Male
D  Sim   19     152      53  Female
E  Rik   21     176      55    Male

### 5

In [174]:
names = ['Ali', 'Arif', 'Kasim', 'Jazib', 'Hamid']
math = np.random.randint(0, 110, size=5)
physics = np.random.randint(0, 110, size=5)
chemistry = np.random.randint(0, 110, size=5)
biology = np.random.randint(0, 110, size=5)
comp=np.random.randint(0,110,size=5)

data = {'Name': names,
        'Mathematics': math,
        'Physics': physics,
        'Chemistry': chemistry,
        'Biology': biology,
       'Computer Science': comp}

students = pd.DataFrame(data,index=np.arange(1,6))

students['Total Marks'] = students['Mathematics'] + students['Physics'] + students['Chemistry'] + students['Biology']+students['Computer Science']
grades=['U','D','C','B','A']
ranges=[0,100,200,300,400,500]
students['Grade'] = pd.cut(students['Total Marks'], ranges, labels=grades)
display(students)

,Name,Mathematics,Physics,Chemistry,Biology,Computer Science,Total Marks,Grade
1,Ali,86,74,44,28,8,240,C
2,Arif,27,47,39,6,92,211,C
3,Kasim,93,90,35,96,61,375,B
4,Jazib,15,36,78,22,64,215,C
5,Hamid,50,61,90,0,16,217,C